tutorials/steadyStateForcedConvection4NFFoam/parabolicTroughCollectorHybridHomogenous/constant/nanoFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nanoFluidProperties;
}
//************************************************ baseFluid ************************************************//
baseFluid			(therminolVP1FuncT);
baseFluidDynamicViscosityModel  Newtonian;
moleFraction			(1.0);
#include "materialsDict.H";


//************************************************ particle ************************************************//
particle			( (AL2O3FuncT MNP) (MWCNT MNP) );
particleDict
{
    AL2O3FuncT
    {
        Components		(AL2O3FuncT);
        moleFraction		(1.0);
    }

    MWCNT
    {
        Components		(MWCNT);
        moleFraction		(1.0);
    }
}


//************************************************ nanoFluid ************************************************//
nanoFluidModel			(hybrid Homogenous);
thermalConductivityModel	Devi;
DeviCoeffs
{
    lambda			(3.0 6.0);
}

dynamicViscosityModel		hybridBrinkman;
hybridBrinkmanCoeffs{}


//***************** Heterogeneous *****************//
brownianDiffusivityModel	Brownian;
BrownianCoeffs
{
    dnp				(33e-9 50e-9);
}

thermophoresisDiffusivityModel	McNabMeisen;
McNabMeisenCoeffs{}
//############################################### End #######################################################//
