tutorials/steadyStateForcedConvection4NFFoam/parabolicTroughCollectorHybridHomogenous/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains	4;

method			simple;

simpleCoeffs
{
    n			( 4 1 1 );
    delta		0.001;
}

hierarchicalCoeffs
{
    n			( 1 1 1 );
    delta		0.001;
    order		xyz;
}

metisCoeffs
{
    processorWeights	( 1 1 1 1 );
}

manualCoeffs
{
    dataFile		"";
}

distributed		no;

roots			( );


// ************************************************************************* //
